# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'homebrew/cask-drivers'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
# brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'ctop'
brew 'ffmpeg'
brew 'fswatch'
# brew 'gh'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'htop'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'mkcert'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe/stripe-cli/stripe'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'php@7.4'
brew 'phive'
brew 'composer'
brew 'imagemagick'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'pv'
brew 'redis'
brew 'svn'
brew 'yarn'
brew 'php-code-sniffer'
brew 'php-cs-fixer'
brew 'wp-cli'
brew 'wp-cli-completion'

# Apps
cask '1password'
cask 'aerial'
cask 'airflow'
cask 'alfred'
# cask 'bettertouchtool'
cask 'camo-studio'
cask 'cleanshot'
# cask 'cloudapp'
cask 'dbngin'
cask 'discord'
cask 'docker'
cask 'farrago'
cask 'figma'
cask 'firefox'
cask 'focusrite-saffire-mixcontrol'
cask 'github'
# cask 'google-backup-and-sync'
cask 'google-chrome'
# cask 'gpg-suite'
cask 'handbrake'
cask 'hey'
cask 'imageoptim'
cask 'insomnia'
cask 'iterm2'
cask 'karabiner-elements'
cask 'loopback'
cask 'mysqlworkbench'
cask 'native-access'
cask 'notion'
cask 'obs'
cask 'phpmon'
cask 'postman'
cask 'ray'
cask 'reaper'
cask 'rectangle'
cask 'rocket'
cask 'securid'
# cask 'sequel-pro'
cask 'shureplus-motiv'
cask 'sip'
cask 'slack'
cask 'sonos'
cask 'soundsource'
cask 'steam'
cask 'sublime-text'
cask 'tableplus'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'transmit'
cask 'transmission'
cask 'tunnelbear'
cask 'tuple'
cask 'visual-studio-code'
# cask 'vagrant'
# cask 'virtualbox' # Might need to allow access in Security settings
# cask 'virtualbox-extension-pack'
cask 'vlc'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'

# Fonts
cask 'font-inter'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
# mas 'Byword', id: 420212497
# mas 'Giphy Capture', id: 668208984
mas 'Harvest', id: 506189836
# mas 'Jira', id: 1475897096
# mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Mainstage 3', id: 634159523
mas 'Pages', id: 409201541
mas 'GarageBand', id: 682658836
# mas 'Spark', id: 1176895641
# mas 'Things', id: 904280696
# mas 'Tweetbot', id: 1384080005
