# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'homebrew/cask-drivers'

# Binaries
# brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'ctop'
brew 'ffmpeg'
brew 'fswatch'
# brew 'gh'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'mkcert'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe/stripe-cli/stripe'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'php@7.3'
brew 'php@7.2'
brew 'composer'
brew 'imagemagick'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'
brew 'php-code-sniffer'
brew 'php-cs-fixer'
brew 'wp-cli'
brew 'wp-cli-completion'

# Apps
cask '1password'
cask 'abstract'
cask 'aerial'
cask 'airflow'
cask 'alfred'
cask 'bartender'
cask 'bettertouchtool'
cask 'caffeine'
cask 'cloudapp'
cask 'disablemonitor'
cask 'discord'
cask 'docker'
cask 'farrago'
cask 'firefox'
cask 'focusrite-saffire-mixcontrol'
cask 'github'
# cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'gpg-suite'
cask 'handbrake'
cask 'imageoptim'
cask 'insomnia'
cask 'iterm2'
cask 'java'
cask 'karabiner-elements'
cask 'lastpass'
cask 'loopback'
cask 'mysqlworkbench'
cask 'notion'
cask 'obs'
cask 'postman'
# cask 'phpstorm'
cask 'reaper'
cask 'rectangle'
cask 'rocket'
# cask 'screenflow'
cask 'securid'
cask 'sequel-pro'
cask 'sip'
# cask 'sketch'
# cask 'skype'
cask 'slack'
cask 'sublime-text'
cask 'tableplus'
# cask 'telegram-desktop'
# cask 'there'
cask 'the-unarchiver'
# cask 'tor-browser'
cask 'transmission'
cask 'transmit'
cask 'tunnelbear'
cask 'tuple'
cask 'vagrant'
cask 'visual-studio-code'
cask 'virtualbox' # Might need to allow access in Security settings
cask 'virtualbox-extension-pack'
cask 'vlc'
cask 'zoomus'
# cask 'whatsapp'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
# mas 'Byword', id: 420212497
# mas 'Giphy Capture', id: 668208984
mas 'Harvest', id: 506189836
mas 'Jira', id: 1475897096
# mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Mainstage 3', id: 634159523
mas 'Pages', id: 409201541
# mas 'Spark', id: 1176895641
# mas 'Things', id: 904280696
# mas 'Tweetbot', id: 1384080005
