# Taps
tap 'homebrew/bundle'

# Binaries
# brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'cloc'
brew 'coreutils' # Those that come with macOS are outdated
brew 'ctop'
brew 'ffmpeg'
brew 'fswatch'
brew 'gh'
brew 'git'
brew 'lazygit'
brew 'gnupg'
brew 'grep'
brew 'htop'
brew 'httpie'
brew 'hub'
# brew 'mackup' # Borked after Oct 2024. Redemption arc?
brew 'mas' # Mac App Store manager
brew 'mkcert'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
# brew 'stripe/stripe-cli/stripe'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'elixir'
brew 'phive'
brew 'pyenv'
brew 'composer'
brew 'imagemagick'
brew 'jq'
brew 'pv'
brew 'svn'
brew 'yarn'
brew 'php-code-sniffer'
brew 'php-cs-fixer'

# Apps
cask '1password'
cask '1password-cli'
# AWS VPN w/ work config
cask 'aerial'
cask 'airflow'
cask 'apidog'
cask 'alfred'
cask 'arc'
cask 'cleanshot'
cask 'dbngin'
cask 'discord'
cask 'docker'
cask 'easy-move-plus-resize'
cask 'farrago'
cask 'figma'
cask 'firefox'
cask 'freac'
cask 'github'
cask 'google-chrome'
cask 'grandperspective'
cask 'handbrake'
cask 'hiddenbar'
cask 'herd'
cask 'hey'
# Audient iD software (audio interface)
cask 'iina'
cask 'imageoptim'
cask 'inkscape'
cask 'insomnia'
cask 'iterm2'
cask 'karabiner-elements'
# cask 'kitty'
cask 'latest'
cask 'loop'
cask 'loopback'
cask 'losslesscut'
cask 'native-access'
cask 'nova'
cask 'obs'
cask 'obsidian'
cask 'onyx'
cask 'qlmarkdown'
cask 'ray'
# cask 'reaper'
# cask 'rectangle'
cask 'shureplus-motiv'
cask 'sip'
cask 'slack'
cask 'soundsource'
cask 'steam'
cask 'sublime-text'
cask 'submline-merge'
cask 'tableplus'
cask 'telegram'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'transmit'
cask 'transmission'
cask 'tuple'
cask 'visual-studio-code'
cask 'vlc'
cask 'xld'
cask 'zed'

# Fonts
cask 'font-inter'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas '1Password for Safari', id: 1569813296
mas 'Actions', id: 1586435171
mas 'Audiobook Binder', id: 413969927
mas 'Boop', id: 1518425043
mas 'Dato', id: 1470584107
mas 'GarageBand', id: 682658836
mas 'Infuse', id: 1136220934
mas 'Keynote', id: 409183694
mas 'JSONPeep', id: 1458969831
mas 'Lungo', id: 1263070803
mas 'Mainstage 3', id: 634159523
mas 'Noir', id: 1592917505
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Speediness', id: 1596706466
mas 'Shortery', id: 1594183810
mas 'WhatsApp', id: 310633997
